const KANA_SEION = [
  { h: 'あ', r: 'a'   }, { h: 'い', r: 'i'   }, { h: 'う', r: 'u'   }, { h: 'え', r: 'e'   }, { h: 'お', r: 'o'   },
  { h: 'か', r: 'ka'  }, { h: 'き', r: 'ki'  }, { h: 'く', r: 'ku'  }, { h: 'け', r: 'ke'  }, { h: 'こ', r: 'ko'  },
  { h: 'さ', r: 'sa'  }, { h: 'し', r: 'shi' }, { h: 'す', r: 'su'  }, { h: 'せ', r: 'se'  }, { h: 'そ', r: 'so'  },
  { h: 'た', r: 'ta'  }, { h: 'ち', r: 'chi' }, { h: 'つ', r: 'tsu' }, { h: 'て', r: 'te'  }, { h: 'と', r: 'to'  },
  { h: 'な', r: 'na'  }, { h: 'に', r: 'ni'  }, { h: 'ぬ', r: 'nu'  }, { h: 'ね', r: 'ne'  }, { h: 'の', r: 'no'  },
  { h: 'は', r: 'ha'  }, { h: 'ひ', r: 'hi'  }, { h: 'ふ', r: 'fu'  }, { h: 'へ', r: 'he'  }, { h: 'ほ', r: 'ho'  },
  { h: 'ま', r: 'ma'  }, { h: 'み', r: 'mi'  }, { h: 'む', r: 'mu'  }, { h: 'め', r: 'me'  }, { h: 'も', r: 'mo'  },
  { h: 'や', r: 'ya'  }, { h: 'ゆ', r: 'yu'  }, { h: 'よ', r: 'yo'  },
  { h: 'ら', r: 'ra'  }, { h: 'り', r: 'ri'  }, { h: 'る', r: 'ru'  }, { h: 'れ', r: 're'  }, { h: 'ろ', r: 'ro'  },
  { h: 'わ', r: 'wa'  }, { h: 'を', r: 'wo'  },
  { h: 'ん', r: 'n'   },
];

const KANA_DAKUTEN = [
  { h: 'が', r: 'ga'  }, { h: 'ぎ', r: 'gi'  }, { h: 'ぐ', r: 'gu'  }, { h: 'げ', r: 'ge'  }, { h: 'ご', r: 'go'  },
  { h: 'ざ', r: 'za'  }, { h: 'じ', r: 'ji'  }, { h: 'ず', r: 'zu'  }, { h: 'ぜ', r: 'ze'  }, { h: 'ぞ', r: 'zo'  },
  { h: 'だ', r: 'da'  }, { h: 'ぢ', r: 'di'  }, { h: 'づ', r: 'du'  }, { h: 'で', r: 'de'  }, { h: 'ど', r: 'do'  },
  { h: 'ば', r: 'ba'  }, { h: 'び', r: 'bi'  }, { h: 'ぶ', r: 'bu'  }, { h: 'べ', r: 'be'  }, { h: 'ぼ', r: 'bo'  },
  { h: 'ぱ', r: 'pa'  }, { h: 'ぴ', r: 'pi'  }, { h: 'ぷ', r: 'pu'  }, { h: 'ぺ', r: 'pe'  }, { h: 'ぽ', r: 'po'  },
];
